CONTROLLER_HEART_BEAT_EXPIRATION = 30
WORKER_HEART_BEAT_INTERVAL = 15

LOGDIR = "."

# Model Constants
IGNORE_INDEX = -100
IMAGE_TOKEN_INDEX = -200
DEFAULT_IMAGE_TOKEN = "<image>"
DEFAULT_IMAGE_PATCH_TOKEN = "<im_patch>"
DEFAULT_IM_START_TOKEN = "<im_start>"
DEFAULT_IM_END_TOKEN = "<im_end>"

DENSITY_CLASSES = ["脂肪型", "纤维腺体型", "不均匀致密型", "致密型", "BLA"]

BI_RADS_CLASSES = [
    "Bi-Rads 0", "Bi-Rads 1", "Bi-Rads 2", "Bi-Rads 3", "Bi-Rads 4A", "Bi-Rads 4B", "Bi-Rads 4C",
    "Bi-Rads 5", "Bi-Rads 6", "BLA"
]

# 实体状态类别映射
ENTITY_CLASSES = ["POS", "NEG", "UNC", "BLA"]

# 实体名称列表（用于顺序对齐）
ENTITY_NAMES = [
    "钙化", "肿块", "乳腺增生", "皮肤增厚", "淋巴结肿大","乳头凹陷", 
    "结构扭曲", "悬韧带增粗", "结节", "结构不对称"
]

DIAGNOSIS = ["Bi-Rads 0", "Bi-Rads 1", "Bi-Rads 2", "Bi-Rads 3",  
        "Bi-Rads 4A", "Bi-Rads 4B", "Bi-Rads 4C", "Bi-Rads 5", "Bi-Rads 6","乳腺癌"]
   
ANATOMY = [
        "左乳外上象限",
        "双乳",
        "左侧中央区",
        "右侧中央区",
        "右乳外下象限",
        "右乳",
        "左乳",
        "右乳外上象限",
        "右乳内上象限",
        "右乳内下象限",
        "左乳内下象限",
        "左乳外下象限",
        "左乳内上象限",
        "左侧乳晕区",
        "右侧乳晕区",
        "右侧腋下",
        "双侧腋下",
        "左侧腋下"
        ]
ADJUNCTS = ['圆形', '密度均匀', '分叶状', '局部不规则', '颗粒状', '壳样', 
            '类圆形', '密度增高', '边缘模糊', '边缘清晰', '部分边缘模糊', '卵圆形', 
            '模糊', '密度不均匀', '线虫样', '结节状', '点状', '不规则', 
            '边缘不规则', '局部', '密度增高且不均匀', '粗糙不均质', 
            '部分边缘清晰', '局灶性', '毛刺影', '斑点状', '簇状', '模糊不定形']

SPECIAL_PHRASES = [
    "脂肪型", "纤维腺体型", "不均匀致密型", "致密型", "Bi-Rads 0", "Bi-Rads 1", "Bi-Rads 2", "Bi-Rads 3", "Bi-Rads 4A",
    "Bi-Rads 4B", "Bi-Rads 4C", "Bi-Rads 5", "Bi-Rads 6", "乳腺癌", "左乳外上象限", "双乳", "左侧中央区", "右侧中央区",
    "右乳外下象限", "右乳", "左乳", "右乳外上象限", "右乳内上象限", "右乳内下象限", "左乳内下象限", "左乳外下象限",
    "左乳内上象限", "左侧乳晕区", "右侧乳晕区", "右侧腋下", "双侧腋下", "左侧腋下", '圆形','密度均匀','分叶状','局部不规则',
    '颗粒状','壳样','类圆形','密度增高','边缘模糊','边缘清晰','部分边缘模糊','卵圆形','模糊','密度不均匀','线虫样',
    '结节状','点状','不规则','边缘不规则','局部','密度增高且不均匀','粗糙不均质','部分边缘清晰','局灶性','毛刺影',
    '斑点状','簇状','模糊不定形',"钙化", "肿块", "乳腺增生", "皮肤增厚", "淋巴结肿大","乳头凹陷", "结构扭曲",
    "悬韧带增粗", "结节", "结构不对称"
]